app/Controllers/UserController.php

    public function listUsers() {
        // Call user model and fetch all users from users table in database
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`


        // Call gender model and fetch all genders value from genders table in database
        $genderModel = new GenderModel();
        $data['genders'] = $genderModel->findAll();
---
SELECT *
FROM `genders`


        // Call gender model and fetch all genders value from genders table in database
        $genderModel = new GenderModel();
        $data['genders'] = $genderModel->findAll();

        // Call user model and fetch the selected user from users table in database
        $userModel = new UserModel();
        $data['user'] = $userModel->find($id);
---
SELECT *
FROM `genders`
SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'